ljufa/esp32_camera/firmware/sdkconfig.defaults.esp32cam
# AI-Thinker-pinout ESP32-CAM (original ESP32, USB-C carrier, OV2640, PSRAM64H)
CONFIG_IDF_TARGET="esp32"
CONFIG_BOARD_TYPE="esp32cam"

# SXGA 1280x1024, matching the S3 board. OV2640 sensor output caps at
# 15 fps above SVGA; drop back to 9 (SVGA) if the fps cost is too high.
CONFIG_FRAME_SIZE=12
CONFIG_JPEG_QUALITY=10

# 4 MB flash @ 80 MHz
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Quad PSRAM @ 80 MHz (requires 80 MHz flash)
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y

CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_esp32cam.csv"

# Camera pins
CONFIG_CAM_PIN_PWDN=32
CONFIG_CAM_PIN_RESET=-1
CONFIG_CAM_PIN_XCLK=0
CONFIG_CAM_PIN_SIOD=26
CONFIG_CAM_PIN_SIOC=27
CONFIG_CAM_PIN_D7=35
CONFIG_CAM_PIN_D6=34
CONFIG_CAM_PIN_D5=39
CONFIG_CAM_PIN_D4=36
CONFIG_CAM_PIN_D3=21
CONFIG_CAM_PIN_D2=19
CONFIG_CAM_PIN_D1=18
CONFIG_CAM_PIN_D0=5
CONFIG_CAM_PIN_VSYNC=25
CONFIG_CAM_PIN_HREF=23
CONFIG_CAM_PIN_PCLK=22
